"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""
number = int(input('Введите номер дома: '))
street = input('Введите название улицы: ')
index = input('Введите индекс: ')
digits = set("0123456789")
home = number > 0 and not (set(street) & digits) and len(index) == 6

final = {True: "Адрес правильный", False: "Адрес не правильный"}
print(final[home])