"""
Задание 6: Статистика по стипендиям

В ИТМО подсчитывают статистику по стипендиям студентов.
Нужно проанализировать данные без использования циклов.

Данные о стипендиях студентов уже заданы словарём.

1. Найдите максимальную стипендию и выведите: Максимальная стипендия: 18000
2. Найдите минимальную стипендию и выведите: Минимальная стипендия: 12000
3. Посчитайте общую сумму и выведите: Общая сумма стипендий: 72000
4. Создайте множество уникальных размеров стипендий
5. Создайте список всех студентов в алфавитном порядке и выведите его
"""

students = {"Иван": 15000, "Мария": 18000, "Петр": 12000, "Анна": 12000, "Ольга": 15000}


print(
    f"Максимальная стипендия: {(max(students.items(), key=(lambda x: x[1])))[1]}"
    )

print(
    f"Минимальная стипендия: {(min(students.items(), key=(lambda x: x[1])))[1]}"
)

print(f'Общая сумма стипендий: {sum(map(lambda x: int(x[1]), students.items()))}')

print(set(map(lambda x: x[1], students.items())))

print(list(sorted(map(lambda x: x[0], students.items()))))