"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

square = int(input('Введите площадь квартиры (кв.м.): '))
district = str(input('Введите район: '))
kitchen = int(input('Введите площадь кухни (кв.м.): '))
balcony = str(input('Балкон: '))
print((square >= 120 + square >= 70 * district == 'Центральный') * (kitchen >= 20) * (balcony == 'есть'), 'Квартира подходит', 'Квартира не подходит')
