"""
Задание 5: Генератор урбанистических слоганов

Создайте генератор слоганов для новых городских проектов, смешивая готовые фразы.

Готовые списки частей слогана starts, middles и ends уже заданы.

Программа должна:
1. Спросить у пользователя индекс для каждой части слогана (0-3)
2. Собрать слоган по формуле: starts[i] + " " + middles[j] + " " + ends[k]
3. Вывести результат
"""

starts = ["Инновационный", "Экологичный", "Передовой", "Комфортный"]
middles = ["городской", "зелёный", "арт", "умный"]
ends = ["ландшафт", "двор", "пространство", "квартал"]

num_st = int(input())
num_mid = int(input())
num_end = int(input())

print( starts[num_st] + " " + middles[num_mid] + " " + ends[num_end])