"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""
code = input()
symbols = '#@#$%^&*;'
result = (
    len(code) == 8
    and any(i in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ' for i in code)
    and any(i in "abcdefghijklmnopqrstuvwxyz" for i in code)
    and any(i in '0123456789' for i in code)
    and sum(i in symbols for i in code) == 1
    and code[0] not in symbols
    and code[-1] not in symbols
)
print(result)
