"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""
colour = input("Введите цвет флага: ")
pattern = input("Введите рисунок на флаге: ")
is_pirate_ship = (colour == "черный") and (pattern == "череп" or pattern == "")
print("Осторожно пираты!" if is_pirate_ship else "Корабль не опасен!")