"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""

def getdata():
    inputs = []
    for i in range(2):
        inputs.append(input())

    return inputs

inputs_ = getdata()
boolval = (inputs_[0] == 'черный') * (inputs_[1] == 'череп' or inputs_[1] == '')

toprint = "Осторожно пираты!" * (boolval) + "Корабль не опасен!" * (not boolval)

print(toprint)
