"""
Задание 4: Анализ студенческих бюджетов

Исследуем, на что тратят деньги студенты в течение недели.

Примечание: все числовые значения — дробные (float).
Для ввода используйте float(input()), а не int(input()).

Категории трат уже заданы кортежем.

1. Сохраните траты в кортеж (в том же порядке, что и категории)
2. Рассчитайте общую сумму трат и выведите её: Общая сумма: 1100.0
3. Найдите самую большую трату и выведите её с категорией:
   Самая большая трата: 500.0 транспорт

Пример:
Введите сумму траты 1: 100.0
Введите сумму траты 2: 500.0
Введите сумму траты 3: 300.0
Введите сумму траты 4: 200.0
Общая сумма: 1100.0
Самая большая трата: 500.0 транспорт
"""

categories = ("продукты", "транспорт", "развлечения", "связь")
list_expenses = [] 

for k in range(len(categories)):
   list_expenses.append(
      float(input(f'Введите сумму траты {k + 1}: '))
   )

max_t = max(enumerate(list_expenses), key=(lambda x: x[1]))

print(f'Общая сумма: {sum(list_expenses)}')

print(
   f"Самая большая трата: {max_t[1]} {categories[max_t[0]]}"
)
