"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""

x = int(input('ВВедите координату x '))
y = int(input('Введите координату y '))
# (1;1) - левая нижняя клетка чёрная

white = (x + y) % 2 != 0
print(f'Поле белое: {white}')
