"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""

x = int(input()) - 1
y = int(input()) - 1 
board = [[0, 1, 0, 1, 0, 1, 0, 1][::[1, -1][j % 2 == 0]] for j in range(8)]
print("Поле белое:", not bool(board[x][y]))
