"""
Задание 6: Статистика по стипендиям

В ИТМО подсчитывают статистику по стипендиям студентов.
Нужно проанализировать данные без использования циклов.

Данные о стипендиях студентов уже заданы словарём.

1. Найдите максимальную стипендию и выведите: Максимальная стипендия: 18000
2. Найдите минимальную стипендию и выведите: Минимальная стипендия: 12000
3. Посчитайте общую сумму и выведите: Общая сумма стипендий: 72000
4. Создайте множество уникальных размеров стипендий
5. Создайте список всех студентов в алфавитном порядке и выведите его
"""

students = {"Иван": 15000, "Мария": 18000, "Петр": 12000, "Анна": 12000, "Ольга": 15000}
max_scholar = max(students.values())
min_scholar = min(students.values())
sum_scholar = sum(students.values())
list_students = list(students.keys())
scholars = set(students.values())

print(f"Максимальная стипендия: {max_scholar}")
print(f"Минимальная стипендия: {min_scholar}")
print(f"Общая сумма стипендий: {sum_scholar}")
print(scholars)
print(sorted(list_students))