"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""

dict_pirate = {
    True : "Осторожно пираты!",
    False : "Корабль не опасен!",
    
}
color = input("Введите цвет флага: ")
painting = input("Введите рисунок на флаге: ")
danger = (color == "черный") and (painting == "череп" or painting == "")

print(dict_pirate[danger])