"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""
color = input('Введите цвет флага: ')
paint = input('Введите рисунок на флаге')
ind = int(color == 'черный' and (paint == 'череп' or paint == ''))
lst = ['Корабль не опасен!', 'Осторожно пираты!']
print(lst[ind])
