"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

area = int(input("Введите площадь квартиры: "))
rayon = input("Введите район: ")
kitchen = int(input("Введите площадь кухни: "))
balcony = input("Наличие балкона (да/нет): ")

yslov = (
    ((area >= 120) or (area >= 70 and rayon == "Центральный")) and
    (kitchen >= 20) and
    (balcony == "да")
)
answers = ["Квартира не подходит", "Квартира подходит"]

print(answers[yslov])
