"""
Задание 13: Анализ списка зданий

Есть список зданий (кортеж словарей).

Нужно одним выражением (без циклов и if) получить список id зданий, которые:

* имеют площадь >= 1000 кв. метров И
* не менее 4 этажей И
* тип — «жилой».

Списки зданий уже заданы. Выведите полученный список id, например: [1, 4]
"""

buildings = (
    {"id": 1, "площадь": 1200, "этажи": 6, "тип": "жилой"},
    {"id": 2, "площадь": 800, "этажи": 3, "тип": "жилой"},
    {"id": 3, "площадь": 1500, "этажи": 5, "тип": "офис"},
    {"id": 4, "площадь": 1000, "этажи": 4, "тип": "жилой"},
    {"id": 5, "площадь": 900, "этажи": 5, "тип": "жилой"},
)

from re import *

usable = list(map(int, map(lambda x: (int(str(x).split()[5][:-1]) > 3) and ("жилой" in str(x).split()[-1]) and (int(str(x).split()[3][:-1]) >= 1000) * int(str(x).split()[1][:-1]), buildings)))
temp = sorted(usable, key=lambda x: not x)
print(temp[:temp.index(0)])
