"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""
# rayonu = ['Центральный', 'Васильеостровский', 'Выборгский', 'Петроградский']
area = int(input('введите площадь кв '))
rayon = input('введите район ')
kitchen = int(input('введите площадь кухни '))
balcon = input('балкон есть? ')

norm = (area >= 120 or area >= 70 and rayon == 'Центральный') and kitchen >= 20 and balcon == 'да'
vivod = ["Квартира не подходит", "Квартира подходит"]
print(vivod[norm])