"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""
y = input()
a = set(y)

s = set("ABCDEFGHIJKLMNOPQRSTUVWXYZ")
s1 = set("abcdefghijklmnopqrstuvwxyz")
s2 = set("0123456789")
s3 = set("#@#$%^&*")

prov = (
    len(y) == 8
    and bool(a & s)
    and bool(a & s1)
    and bool(a & s2)
    and len(a & s3) == 1
    and y[0] not in s3
    and y[-1] not in s3
)

print(prov)
