"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

sqwr = int(input('Введите площадь: ')) 
district = str(input('Введите район: '))
sqwr_kitchen = int(input('Введите площадь кухни: '))
balcon = str(input('Есть ли балкон (да/нет): '))

flat ={
    True : 'Квартира подходит',
    False : 'Квартира не подходит'
}

okey = (sqwr >= 120 or (sqwr >= 70 and district == 'Центральный'))\
    and sqwr_kitchen >= 20 and (balcon == 'да' or balcon == 'Да')
print(flat[okey])