"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""
a=input()
b=input()
c=input()
d=input()
kv=a,b,c,d
o=(int(a)>=120 or (int(a)>=70 and b=="Центральный")) and int(c)>=20 and d=='да'
otv=['Квартира не подходит', 'Квартира подходит']
print(otv[o])