"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""

code = input("Введите код доступа: ")
specialSymbols = ('#', '@', '$', '%', '^', '&', '*')

print((len(code) >= 8) and not (code.isnumeric()) and not (code.islower()) and not (code.isupper()) and any(specialSymbols[x] in code for x in range(len(code))) and (code[0] not in specialSymbols) and (code[-1] not in specialSymbols))