"""
Задание 6: Статистика по стипендиям

В ИТМО подсчитывают статистику по стипендиям студентов.
Нужно проанализировать данные без использования циклов.

Данные о стипендиях студентов уже заданы словарём.

1. Найдите максимальную стипендию и выведите: Максимальная стипендия: 18000
2. Найдите минимальную стипендию и выведите: Минимальная стипендия: 12000
3. Посчитайте общую сумму и выведите: Общая сумма стипендий: 72000
4. Создайте множество уникальных размеров стипендий
5. Создайте список всех студентов в алфавитном порядке и выведите его
"""

students = {"Иван": 15000, "Мария": 18000, "Петр": 12000, "Анна": 12000, "Ольга": 15000}

maximum = max(students.values())
minimum = min(students.values())
summa = sum(students.values())
unique = set(students.values())
sort_list = sorted(students)
print(f'Максимальная стипендия: {maximum}')
print(f'Минимальная стипендия: {minimum}')
print(f'Общая сумма стипендий: {summa}')
print(unique)
print(sort_list)
