"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""
number = float(input('Введите номер дома: '))
street = str(input('Введите название улицы: '))
index = str(input('Введите индекс: '))

if number > 0 and int(number) == number and ' ' not in street and len(index) == 6:
    print(True)
else:
    print(False)