"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""
pirate_ships = {
    True : 'Осторожно пираты!',
    False : 'Корабль не опасен!'
}
color = str(input('Введите цвет флага: '))
art = str(input('Введите рисунок на флаге: '))

danger = (color == 'черный' and (art == '' or art == 'череп'))
print(pirate_ships.get(danger))