"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.;
* специальный символ не может стоять на первой или последней позиции.
"""
code = input('Введите код: ')
cap_letters = set('QWERTYUIOPASDFGHJKLZXCVBNM')
low_letters = set('qwertyuiopasdfghjklzxcvbnm')
special_symbols = set('#@#$%^&*;')
numbers = set('1234567890')

condition = len(code) == 8 and bool(set(code) & cap_letters) and bool(set(code) & low_letters) and bool(set(code) & numbers) and len(set(code) & special_symbols) == 1 and code[0] not in special_symbols and code[-1] not in special_symbols

print(condition)