"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""
a = int(input())
b = int(input())
if (a % 2 == 1 and b % 2 == 1) or (a % 2 == 0 and b % 2 == 0):
    print("Поле белое:", False)
elif a < 1 or a > 8 or b < 1 or b > 8:
    print("Неправильное значение")
else:
    print("Поле белое:", True)