"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""
x = int(input('Введите x: '))
y = int(input('Введите y: '))

is_white = abs(x + y) % 2 == 1
print(f'Поле белое: {True if is_white else False}') 