"""
Задание 6: Статистика по стипендиям

В ИТМО подсчитывают статистику по стипендиям студентов.
Нужно проанализировать данные без использования циклов.

Данные о стипендиях студентов уже заданы словарём.

1. Найдите максимальную стипендию и выведите: Максимальная стипендия: 18000
2. Найдите минимальную стипендию и выведите: Минимальная стипендия: 12000
3. Посчитайте общую сумму и выведите: Общая сумма стипендий: 72000
4. Создайте множество уникальных размеров стипендий
5. Создайте список всех студентов в алфавитном порядке и выведите его
"""

students = {"Иван": 15000, "Мария": 18000, "Петр": 12000, "Анна": 12000, "Ольга": 15000}
max_stup = max(students.values())
print(f'Максимальная стипендия: {max_stup}')
min_stup = min(students.values())
print(f'Минимальная стипендия: {min_stup}')
ob_sum = sum(students.values())
print(f'Общая сумма стипендий: {ob_sum}')
unikym = set(students.values())
print(unikym)
alf = sorted(students.keys())
print(f'Студенты в алфавитном порядке: {alf}')

#py -m pytest tests/test_02_python_structures/test_task6_scholarships.py -v 
