"""
Задание 3: Рейтинг кофеен вокруг университета

Студенты-урбанисты исследовали, где лучше всего готовят кофе для подготовки первого зачета.

Рейтинги кофеен уже заданы словарём.

1. Добавьте новую кофейню "Бессонный урбанист" с рейтингом 8
2. Увеличьте рейтинг "Цифербурга" на 1 (он стал ещё лучше!)
3. Выведите лучшую кофейню строкой вида:
   Лучшая кофейня: Цифербург с рейтингом 10
"""

shops = {"Цифербург": 9, "Итальянская": 7, "Пятая линия": 5}
shops["Бессонный урбанист"] = 8
shops["Цифербург"] = 10
max_value = 0
for shop_value in shops.values():
    if shop_value > max_value:
        max_value = shop_value
for key, value in shops.items():
    if value == max_value:
        print(f'Лучшая кофейня: {key} с рейтингом {value}')
