"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""

x, y = int(input("Введите координату x: ")), int(input("Введите координату y: "))
if (x + y) % 2 == 0:
    print(f"Поле белое: {False}")
else:
    print(f"Поле белое: {True}")
