"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""
square = int(input('Введите площадь квартиры: '))
district = input('Введите район: ').lower().strip()
kitchen = int(input('Введите площадь кухни: '))
balcony = input('Есть ли балкон? ').lower().strip()

is_apart_good = ['Квартира не подходит', 'Квартира подходит']

is_district_ok = ((square >= 120) or (square >= 70 and district == 'центральный'))
is_kitchen_ok = kitchen >= 20
is_balcony_ok = balcony == 'да'


condition = int(is_district_ok and is_kitchen_ok and is_balcony_ok)

print(is_apart_good[condition])