"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""
house_number = input('Введите номер вашего дома: ')
street = input('Введите вашу улицу: ')
house_index = input('Введите ваш индекс: ')

if house_number.isdigit() :
    if house_index.isdigit():
        if len(house_index) == 6:
            if street.replace(' ', '').replace('-', '').isalpha():
                print(True)
else:
    print(False)
