"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""

x1 = int(input("x1: "))
y1 = int(input("y1: "))
x2 = int(input("x2: "))
y2 = int(input("y2: "))
sum_color = ((x1 + y1) % 2) == ((x2 + y2) % 2)
print(f"Клетки одинакового цвета: {sum_color}")
#py -m pytest tests/test_02_python_structures/test_task12_chessboard_same_color.py -v

