"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""

flagColor, flagSymbol = input("Введите цвет флага: "), input("Введите рисунок на флаге: ")

matchColor = flagColor == "черный"
matchSymbol = flagSymbol == "" or flagSymbol == "череп"

isPirate = matchColor & matchSymbol

match isPirate:
    case True:
        print("Осторожно пираты!")
    case False:
        print("Корабль не опасен!")
