"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""
x1 = int(input('Введите целое число x1 от 1 до 8: '))
x2 = int(input('Введите целое число x2 от 1 до 8: '))
y1 = int(input('Введите целое число y1 от 1 до 8: '))
y2 = int(input('Введите целое число y2 от 1 до 8: '))

is_same_color = (x1 + y1) % 2 == (x2 + y2) % 2
print(is_same_color)