"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""


def check_check(x, y):

    if x not in range(1, 9) or y not in range(1, 9):
        raise ValueError(f"нету  клеток {(x, y)} на шахматной доске")
    
    return (x + y) % 2 == 1


print(
    f'Поле белое: {check_check(int(input()), int(input()))}'
)

