"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""

import string
lowers = set(string.ascii_lowercase)
uppers = set(string.ascii_uppercase)
digits = set(string.digits)
symbols = set('@#$%^&*')

code = str(input('Введите код: '))
code_set = set(code)

print(len(code_set) == 8 
      and len(lowers & code_set) > 0 
      and len(uppers & code_set) > 0 
      and len(digits & code_set) > 0  
      and len(symbols & code_set) == 1 
      and (code[0] not in symbols) 
      and (code[-1] not in symbols)
)
