"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""
cod = input('введите код ')
cifru = '0' in cod or '1' in cod or '2' in cod or '3' in cod or '4' in cod or '5' in cod or '6' in cod or '7' in cod or '8' in cod or '9' in cod
specc = cod.count('#') + cod.count('@') + cod.count('%') + cod.count('^') + cod.count('$') + cod.count('&')
posiciya = not cod.startswith(('#', '@', '$', '%', '^', '&', '*')) and not cod.endswith(('#', '@', '$', '%', '^', '&', '*'))
pravilno = len(cod) == 8 and cifru and specc == 1 and posiciya
print(pravilno)