"""
Задание 4: Анализ студенческих бюджетов

Исследуем, на что тратят деньги студенты в течение недели.

Примечание: все числовые значения — дробные (float).
Для ввода используйте float(input()), а не int(input()).

Категории трат уже заданы кортежем.

1. Сохраните траты в кортеж (в том же порядке, что и категории)
2. Рассчитайте общую сумму трат и выведите её: Общая сумма: 1100.0
3. Найдите самую большую трату и выведите её с категорией:
   Самая большая трата: 500.0 транспорт

Пример:
Введите сумму траты 1: 100.0
Введите сумму траты 2: 500.0
Введите сумму траты 3: 300.0
Введите сумму траты 4: 200.0
Общая сумма: 1100.0
Самая большая трата: 500.0 транспорт
"""

categories = ("продукты", "транспорт", "развлечения", "связь")
trati = (0, 0, 0, 0)
trati2 = list(trati)
for i in range(4):
    trati2[i] = float(input(f'Введите сумму траты {i + 1} '))
summa = 0
for j in trati2:
    summa += j
flag = 0
schet = 0
for k in trati2:
    if k > flag:
        flag = k
        schet += 1
print(f'Общая сумма: {summa}')
print(f'Самая большая трата: {flag} {categories[schet - 1]}')
