"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""

num_house = int(input("Номер дома"))
street_name = input("Название улицы")
indx_house = input("Индекс дома")
print(
    num_house > 0
    and all(char not in "0123456789" for char in street_name)
    and len(indx_house) == 6
    and indx_house.isdigit()
)
