"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""
a1, a2 = int(input()), int(input())
b1, b2 = int(input()), int(input())
if (a1 % 2 == 1 and a2 % 2 == 1) or (a1 % 2 == 0 and b1 % 2 == 0):
    a = "белое"
else:
    a = "черное"
if (b1 % 2 == 1 and b2 % 2 == 1) or (b1 % 2 == 0 and b2 % 2 == 0):
    b = "белое"
else:
    b = "черное"
if a == b:
    print("Клетки одинакового цвета:", True)
else:
    print("Клетки одинакового цвета:", False)  