"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""

def check_check2(t1: tuple, t2: tuple):
    return ((t1[0] + t1[1]) % 2 == 1) == ((t2[0] + t2[1]) % 2 == 1)

print('Клетки одинакового цвета: ' +
    str(
        check_check2(
        (int(input()), int(input())),
        (int(input()), int(input()))
        )
    )
)