"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""
from re import *
code = str(input('Введите строку: '))
normal_len = len(code) == 8
big_letter = r'[A-Z]+'
small_letter = r'[a-z]+'
num = r'[0-9]+'


special = set('#@#$%^&*')
okey = normal_len and (bool(search(big_letter,code)))\
    and (bool(search(small_letter,code))) and (bool(search(num,code)))\
            and len(set(code) & special) == 1 and (code[0] not in special\
            and (code[-1] not in special))
    

print(okey)
