"""
Задание 2: Поиск потерянных наушников

В кампусе ИТМО постоянно теряют наушники. Создайте систему для отслеживания находок!
Данные о находках за два дня уже заданы.

Пример вывода:
1. Находили оба дня: {'беспроводные Sony'}
2. Только сегодня: {'Samsung Buds', 'старые советские'}
3. Всего уникальных моделей: 5
"""

yesterday = {"беспроводные Sony", "AirPods", "JBL"}
today = {"беспроводные Sony", "Samsung Buds", "старые советские"}

both_days = yesterday & today
only_today = today - yesterday
all_unique = yesterday | today

print(f'1. Находили оба дня: {both_days}')
print(f'2. Только сегодня: {only_today}')
print(f'3. Всего уникальных моделей: {len(all_unique)}') 
