"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""
square, district, kitchen, balcony = int(input('Введите площадь квартиры: ')), input(
    'Введите район: ').lower(), int(input('Введите площадь кухни: ')), input('Есть ли балкон: ')
lst = ['Квартира не подходит', 'Квартира подходит']
ind = (((square > 120 and district != 'центральный') or (square > 70 and district == 'центральный'))
       and kitchen >= 20 and balcony == 'да')
print(lst[ind])
