"""
Задание 3: Рейтинг кофеен вокруг университета

Студенты-урбанисты исследовали, где лучше всего готовят кофе для подготовки первого зачета.

Рейтинги кофеен уже заданы словарём.

1. Добавьте новую кофейню "Бессонный урбанист" с рейтингом 8
2. Увеличьте рейтинг "Цифербурга" на 1 (он стал ещё лучше!)
3. Выведите лучшую кофейню строкой вида:
   Лучшая кофейня: Цифербург с рейтингом 10
"""

shops = {"Цифербург": 9, "Итальянская": 7, "Пятая линия": 5}

shops['Бессонный урбанист'] = 8

try:
   shops["Цифербург"] += 1
except KeyError:
   print("dne")


def backlink(dict_: dict):
   return { k:(k, v) for k, v in dict_.items() }

def maxfromdict(dict_: dict):
   return max(backlink(shops).values(), key=(lambda x: x[1]))



print(
   f"Лучшая кофейня: {maxfromdict(shops)[0]} с рейтингом {maxfromdict(shops)[1]}"
)
