"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""
a=input("Введите адрес в формате 'дом, улица, индекс': ")
b=a.split(", ")
if b[1].isdigit() or not b[0].isdigit() or len(b[2])!=6 or not b[2].isdigit():
    print(False)
else:
    print(True)