"""
Задание 11: Шахматная доска

Предположим, что строчки и столбики шахматной доски пронумерованы цифрами.
Левое нижнее и правое верхнее поля являются черными. Каждая клетка характеризуется
двумя координатами — номером столбика и номером строчки.

Программа получает на вход целые числа x, y в диапазоне от 1 до 8 и проверяет
истинность высказывания «это поле белое».
"""

"""
б ч б ч б ч б ч
ч б ч б ч б ч б
б ч б ч б ч б ч
ч б ч б ч б ч б
б ч б ч б ч б ч
ч б ч б ч б ч б
б ч б ч б ч б ч
ч б ч б ч б ч б
"""
x = int(input())
y = int(input())
if x % 2 == 0 and y % 2 == 0 or x % 2 != 0 and y % 2 != 0:
    print('Поле белое:', False)
else:
    print('Поле белое:', True)
