"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

area = int(input("Площадь "))
district = input("Район ")
kit_area = int(input("Площадь кухни "))
balc = input("Балкон ")

print((area >= 120 or area >= 70 and district == 'Центральный') and kit_area >= 20 and balc == 'да')
