"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

location, surfaceTotal, surfaceKitchen, isWithBalcony = input("Введите название района: "), int(input("Введите площадь квартиры: ")), int(input("Введите площадь кухни: ")), bool(int(input("Введите количество балконов: ")) > 0)

print(((location == "Центральный" and surfaceTotal >= 70) or (surfaceTotal >= 120)) and surfaceKitchen >= 20 and isWithBalcony)
