"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""

x1 = int(input('Введите x1: '))
x2 = int(input('Введите x2: '))
y1 = int(input('Введите y1: '))
y2 = int(input('Введите y2: '))

same_or_not = (x1 + x2)%2 == (y1 + y2)%2


print(f'Клетки одинакового цвета: {same_or_not} ')