"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

surf_apart = int(input("Площадь квартиры"))
district = input("Район")
surf_kitchen = int(input("Площадь кухни"))
balcony = input("Балкон")

result = (
    (surf_apart >= 120 or (surf_apart >= 70 and district == "Центральный"))
    and surf_kitchen >= 20
    and balcony == "да"
)

print({True: "Квартира подходит", False: "Квартира не подходит"}[result])
