"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""

color_flag = input("Цвет флага: ")
pict_flag = input("Рисунок на флаге: ")

pirate = (color_flag == "черный") and (pict_flag == "череп" or pict_flag == "")

messages = {True: "Осторожно пираты!", False: "Корабль не опасен!"}

print(messages[pirate])
