"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""
a=input("Введите адрес в формате 'дом, улица, индекс': ")
c=input("Введите адрес в формате 'дом, улица, индекс': ")
d=input("Введите адрес в формате 'дом, улица, индекс': ")
b=[a, c, d]
if b[0].isdigit() and int(b[0])>0 and not any(i.isdigit() for i in b[1]) and len(b[2])==6 and b[2].isdigit():
    print(True)
else:
    print(False)