"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""

address = [input() for _ in range(3)]
try:
    first = int(address[0])
    last = int(address[2])
    print((first > 0) and all([i not in address[1] for i in "0123456789"]) and (len(address[2]) == 6))
except:
    print(False)