"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""
area = int(input('Введите площадь квартиры в кв. метрах: '))
zone = input('Введите район: ')
kitchen = int(input('Введите площадь кухни в кв. метрах: '))
balcony = input('Есть ли балкон? ')
house = (area >= 120 or (area >= 70 and zone == 'Центральный')) and kitchen >= 20 and balcony.lower() == 'да'
final = {True: "Квартира подходит", False: "Квартира не подходит"}
print(final[house])