"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""
x1 = int(input("Введите координату x: "))
y1 = int(input("Введите координату y: "))
x2 = int(input("Введите координату x: "))
y2 = int(input("Введите координату y: "))
is_white1 = abs(x1 - y1) % 2 != 0
is_white2 = abs(x2 - y2)% 2 != 0
is_same = is_white1 == is_white2
print(f"Клетки одинакового цвета: {is_same}")