"""
Задание 14: Секретный код доступа

Вы — агент спецслужбы. Вам передали зашифрованное сообщение с кодом доступа к серверу.
Код должен соответствовать строгим правилам безопасности. Ваша задача — проверить,
является ли предоставленная строка валидным кодом доступа, не используя циклы и условные операторы.

Код считается корректным, если:
* длина строки — ровно 8 символов;
* содержит хотя бы одну заглавную букву (A-Z);
* содержит хотя бы одну строчную букву (a-z);
* включает хотя бы одну цифру (0-9);
* имеет ровно один специальный символ из набора: #@#$%^&*;
* специальный символ не может стоять на первой или последней позиции.
"""

code = input()
spec = '@#$%^&*'
print(len(code) == 8 and 
      any(filter(lambda x: x.isalpha() and x.isupper(), code)) and
      any(filter(lambda x: x.isalpha() and x.islower(), code)) and
      any(filter(lambda x: x.isdigit(), code)) and
      sum(map(lambda x: code.count(x), spec)) == 1 and
      code[0] not in spec and code[-1] not in spec)
