"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""
dict_answers = {
    True : "Квартира подходит",
    False : "Квартира не подходит"

}
area_apart = int(input("Введите площадь квартиры(в кв. метрах): "))
district = input("Введите район: ")
area_kitch = int(input("Введите площадь кухни: "))
balcon = input("Наличие балкона (да/нет): ")
is_approved = ((area_apart >= 120 ) or (area_apart >= 70 and district == "Центральный")) and area_kitch >= 20 and balcon == "да"
print(dict_answers[is_approved])
