"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""
number = input('Введите номер дома: ')
street = input('Введите название улицы: ')
ind = input('Введите индекс дома: ')
print(str(number).isdigit() and int(number) > 0 and all(str(i) not in street for i in range(0, 10)) \
       and len(ind) == 6 and ind.isdigit())
