"""
Задание 12: Шахматная доска. Опять

Разработайте программу, которая получает на вход координаты двух клеток шахматной доски
x1, y1 и x2, y2 и проверяет истинность высказывания «эти клетки одинакового цвета».

Не используйте при решении этой задачи логические операции и конструкции ветвления,
их мы изучим позже, постарайтесь обойтись логическими переменными и арифметическими операциями.

Предполагается, что программа получает на вход целые числа в диапазоне от 1 до 8.
"""
x1 = int(input()) - 1
y1 = int(input()) - 1 
x2 = int(input()) - 1
y2 = int(input()) - 1 
board = [[0, 1, 0, 1, 0, 1, 0, 1][::[1, -1][j % 2 == 0]] for j in range(8)]
print("Клетки одинакового цвета:", bool(board[x1][y1] == board[x2][y2]))