"""
Задание 4: Анализ студенческих бюджетов

Исследуем, на что тратят деньги студенты в течение недели.

Примечание: все числовые значения — дробные (float).
Для ввода используйте float(input()), а не int(input()).

Категории трат уже заданы кортежем.

1. Сохраните траты в кортеж (в том же порядке, что и категории)
2. Рассчитайте общую сумму трат и выведите её: Общая сумма: 1100.0
3. Найдите самую большую трату и выведите её с категорией:
   Самая большая трата: 500.0 транспорт

Пример:
Введите сумму траты 1: 100.0
Введите сумму траты 2: 500.0
Введите сумму траты 3: 300.0
Введите сумму траты 4: 200.0
Общая сумма: 1100.0
Самая большая трата: 500.0 транспорт
"""

categories = ("продукты", "транспорт", "развлечения", "связь")

exp_1 = float(input("Введите сумму траты 1: "))
exp_2 = float(input("Введите сумму траты 2: "))
exp_3 = float(input("Введите сумму траты 3: "))
exp_4 = float(input("Введите сумму траты 4: "))

exp_tuple = (exp_1, exp_2, exp_3, exp_4)
sum_exp = sum(exp_tuple)
exp_max = max(exp_tuple)
ind = exp_tuple.index(max(exp_tuple))
print(f"Общая сумма: {sum_exp}")
print(f"Самая большая трата: {max(exp_tuple)} {categories[ind]}")
