"""
Задание 9: Проверка корректности адреса

Адрес считается корректным, если:

* номер дома — целое положительное число;
* название улицы не содержит цифр;
* индекс (в виде строки) состоит ровно из 6 цифр.

Проверьте данные и верните сообщение о правильности или неправильности адреса в зависимости от них.
"""

def check_adress(house_num, st_name, index):
    return (
        (int(house_num) > 0) and len(set(st_name) & set('0123456789')) == 0 and len(index) == 6
    )

print(check_adress(input(), input(), input()))