"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""
color = input('введите цвет флага: ')
img = input('что нарисовано? ')
cherni = (color == 'черный') or (color == 'чёрный')
cherep = (img == 'череп') or (img == '')
pirat = cherni and cherep
alarm = "Осторожно пираты!" * pirat + "Корабль не опасен!" * (not pirat)
print(alarm)