"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

square = int(input("Введите площадь квартиры (кв.м): "))
neighbourhood = input("Введите название района: ")
kitchen_square = int(input("Введите площадь кухни (кв.м): "))
balcony = input("Наличие балкона: ")
conditions = [
    square >= 120 or (square >= 70 and neighbourhood == "Центральный"),
    kitchen_square >= 20,
    balcony == "Да" or balcony == "да",
]
options = {
    True: "Квартира подходит",
    False: "Квартира не подходит",
}
print(options[all(conditions)])
