"""
Задание 10: Пиратские корабли

Для защиты корабля капитан Сэм попросил бортинженера Тома реализовать автоматическое
распознавание кораблей пиратов острова "Island X".

Правила определения пиратского корабля:
* цвет флага — «черный»;
* рисунок на флаге — «череп» или Enter (пустая строка).

Программа должна выводить сообщение «Осторожно пираты!», если распознан пиратский корабль,
и «Корабль не опасен!», если не распознан.

Внимание: оператор If использовать запрещается.
"""

flag_color = input("Цвет флага: ")
flag_design = input("Рисунок на флаге: ")
is_pirate = (flag_color == "черный") and (flag_design == "череп" or flag_design == "")
sms = ["Корабль не опасен!", "Осторожно пираты!"]
print(sms[int(is_pirate)])

#py -m pytest tests/test_02_python_structures/test_task10_pirate_ship.py -v 