"""
Задание 15: Покупка квартиры

Петр Петрович заработал солидную сумму и, боясь инфляции, решил купить квартиру,
которая должна удовлетворять следующим условиям:
* площадь от 120 кв. метров в любом районе или площадь от 70 кв. метров, но в Центральном районе;
* площадь кухни должна быть не меньше 20 кв. метров;
* обязательно наличие балкона.

Напишите программу, которая определяет, соответствует ли квартира данным критериям.

Внимание: использовать IF-ELSE запрещается.

Программа должна выводить сообщение «Квартира подходит» или «Квартира не подходит».
"""

area = float(input("Площадь: "))
district = input("Район: ")
kitchen = float(input("Площадь кухни: "))
balcony = input("Есть балкон? ")
area_ = area >= 120 or (area >= 70 and district == 'Центральный')
kitchen_ = kitchen >= 20
balcony_ = balcony == 'да'
ind = area_ and kitchen_ and balcony_
message = ['Квартира не подходит', 'Квартира подходит']
print(message[ind])
