"""
Задание 1: Учёт имён для скамеек

Городские власти решили, что у каждой скамейки должно быть креативное имя.
Но дизайнеры перестарались - придумали такие названия, что даже голова кружится!

Исходные скамейки уже есть в списке:

1. Добавьте в список новую скамейку: "Банка Просветления у Кронверка"
2. Выведите все названия через запятую
3. Подсчитайте, сколько всего скамеек (элементов в списке) и выведите
   результат строкой вида: Всего скамеек: 4
"""

benches = ["Скамейка Раздумий у Политеха", "Лавка Знаний у Кронверкского", "Пень Свободы у Вокзала"]
