# module_01_python_basics/practice/task1_variables.py
"""
Задание 1. Анкета для соцопроса

Напишите программу, которая:
1. Запрашивает у пользователя имя
2. Запрашивает у пользователя возраст
3. Выводит приветствие: "Привет, {имя}! Тебе {возраст} лет."

Пример:
Введите ваше имя: Иван
Введите ваш возраст: 20
Привет, Иван! Тебе 20 лет.
"""

<<<<<<< HEAD
name = input("Введите ваше имя: ")
age = input("Введите ваш возраст: ")
print(f"Привет, {name}! Тебе {age} лет.")
=======
name=input(' Введите ваше имя: ')
age=input('Введите ваш возраст: ')
print(f'Привет, {name}! Тебе {age} лет.')
>>>>>>> cd46f1c7b1ea483594cd9808f9ec0e043fcd6e81
