# module_01_python_basics/practice/task4_functions.py
"""
Задание 4: Международный весооборот

Напишите программу, которая:
1. Запрашивает вес и единицу измерения (кг, г, фунт, пуд, ц, т)
2. Переводит вес в килограммы
3. Выводит: "{вес} {единица} = {результат} кг"

Коэффициенты перевода в кг:
- 1 кг = 1 кг
- 1 г = 0.001 кг
- 1 фунт = 0.40951241 кг
- 1 пуд = 16 кг
- 1 ц = 100 кг
- 1 т = 1000 кг

Пример:
Введите вес и единицу измерения (например, '10 кг'): 1 т
1.0 т = 1000.000000 кг
"""
weight = input("Введите вес и единицу измерения (например, '10 кг'): ")
parts = weight.split()
lot = float(parts[0])
rate =  parts[1]
if rate == 'кг' :
    lot_1 = lot * 1
elif rate == 'г' :
    lot_1 = lot * 0.001
elif rate == 'фунт' :
    lot_1 = lot * 0.40951241
elif rate == 'пуд' :
    lot_1 = lot * 16
elif rate == 'ц' :
    lot_1 = lot * 100
elif rate == 'т' :
    lot_1 = lot * 1000

print(f'{lot} {rate} = {lot_1} кг')

