# module_01_python_basics/practice/task4_functions.py
"""
Задание 4: Международный весооборот

Напишите программу, которая:
1. Запрашивает вес и единицу измерения (кг, г, фунт, пуд, ц, т)
2. Переводит вес в килограммы
3. Выводит: "{вес} {единица} = {результат} кг"

Коэффициенты перевода в кг:
- 1 кг = 1 кг
- 1 г = 0.001 кг
- 1 фунт = 0.40951241 кг
- 1 пуд = 16 кг
- 1 ц = 100 кг
- 1 т = 1000 кг

Пример:
Введите вес и единицу измерения (например, '10 кг'): 1 т
1.0 т = 1000.000000 кг
"""
data = str(input("Введите вес и единицу измерения (например, '10 кг'): "))
weight, ed = data.split()
weight = float(weight)
if ed == 'кг': 
    print(weight, ed, '=', weight, ed)
if ed == 'г': 
    print(weight, ed, '=', weight*0.001, 'кг')
if ed == 'фунт': 
    print(weight, ed, '=', weight*0.40951241, 'кг')
if ed == 'пуд': 
    print(weight, ed, '=', weight*16, 'кг')
if ed == 'ц': 
    print(weight, ed, '=', weight*100, 'кг')
if ed == 'т': 
    print(weight, ed, '=', weight*1000, 'кг')
