"""
Задание 2: Подсчёт этажей с учётом ограничений

В городе действует ограничение:

* в исторической зоне — не выше 5 этажей;
* в новой застройке — не выше 20 этажей.

Программа:

1. Запрашивает зону («историческая» или «новая»).
2. Запрашивает количество этажей.
3. С помощью ветвления проверяет, соответствует ли этажность норме.
4. Выводит: «Допустимо» или «Превышение нормы!».
"""
city_zone = input("Введите зону: ")
floors_amount = int(input("Введите количество этажей: "))
if city_zone == "историческая":
    if floors_amount <= 5:
        print("Допустимо")
    else:
        print("Превышение нормы!")
else:
    if floors_amount <= 20:
        print("Допустимо")
    else:
        print("Превышение нормы!")