"""
Задание 2: Подсчёт этажей с учётом ограничений

В городе действует ограничение:

* в исторической зоне — не выше 5 этажей;
* в новой застройке — не выше 20 этажей.

Программа:

1. Запрашивает зону («историческая» или «новая»).
2. Запрашивает количество этажей.
3. С помощью ветвления проверяет, соответствует ли этажность норме.
4. Выводит: «Допустимо» или «Превышение нормы!».
"""
zona = input('Введите зону:')
kolichestvo_floor = int(input('Введите колличество этажей:'))
if zona == "историческая":
    if kolichestvo_floor <= 5:
        print('Допустимо')
    else:
        print('Превышение нормы!')
elif zona == "новая":
    if kolichestvo_floor <= 20:
        print('Допустимо')
    else:
        print('Превышение нормы!')
else:
    print('Неизвестная зона')
