"""
Задание 3: Распределение зелёных зон по районам

Есть 3 района города с разной площадью зелёных зон (в га):

* район A: 150 га;
* район B: 80 га;
* район C: 200 га.

Программа перебирает районы. Для каждого района:

1. Если площадь >= 150 га → уровень «Высокий уровень озеленения»;
2. Если 50 <= площадь < 150 → «Средний уровень»;
3. Иначе → «Низкий уровень».

Для каждого района выведите строку в формате:

    Район <буква>: <уровень>

Например: «Район A: Высокий уровень озеленения», «Район B: Средний уровень».
"""


def _measureGreen(area: int):

    if area >= 150:
        return 'Высокий уровень озеленения'
    elif 50 <= area < 150:
        return 'Средний уровень'
    else:
        return 'Низкий уровень'
    


regions: dict[str, int] = {
    'A': 150,
    'B': 80,
    'C': 200,
}



for each in regions.items():
    print(
        f'Район {each[0]}: {_measureGreen(each[1])}' 
    )




