"""
Задание 2: Подсчёт этажей с учётом ограничений

В городе действует ограничение:

* в исторической зоне — не выше 5 этажей;
* в новой застройке — не выше 20 этажей.

Программа:

1. Запрашивает зону («историческая» или «новая»).
2. Запрашивает количество этажей.
3. С помощью ветвления проверяет, соответствует ли этажность норме.
4. Выводит: «Допустимо» или «Превышение нормы!».
"""

_zones: dict = {'историческая': 5, 'новая': 20}

def _logic(zone: str, floors: int):
    return _zones[zone] >= floors

print(
    'Допустимо' if _logic(input(), int(input())) else 'Превышение нормы!'
)