"""
Задание 2: Подсчёт этажей с учётом ограничений

В городе действует ограничение:

* в исторической зоне — не выше 5 этажей;
* в новой застройке — не выше 20 этажей.

Программа:

1. Запрашивает зону («историческая» или «новая»).
2. Запрашивает количество этажей.
3. С помощью ветвления проверяет, соответствует ли этажность норме.
4. Выводит: «Допустимо» или «Превышение нормы!».
"""

zone = input('Зона: ')
floor = int(input('Этаж: '))
if zone == 'историческая':
    if floor > 5:
        print('Превышение нормы!')
    else:
        print('Допустимо')
if zone == 'новая':
    if floor > 20:
        print('Превышение нормы!')
    else:
        print('Допустимо')
