"""
Задание 9: Баланс зелёных зон и застройки

В городе должна соблюдаться норма: не менее 30 % площади — зелёные зоны. Программа:

1. Запрашивает общую площадь района (в га).
2. В цикле while запрашивает площадь очередной застройки (в га) до ввода 0.
3. На каждом шаге:

   * добавляет площадь застройки к суммарной;
   * вычисляет текущую долю зелёных зон: (общая_площадь − суммарная_застройка) / общая_площадь;
   * если доля зелёных зон < 30 %, выводит предупреждение «Нарушение нормы зелёных зон!».

4. Если цикл завершился без нарушений, выводит: «Нормы соблюдены».
"""

total_square = int(input("Введите общую площадь района (в га): "))
now_development = int(input("Введите площадь очередной застройки (в га): "))
all_development = 0
flag = 0
while now_development != 0:
    all_development += now_development
    if ((total_square - all_development) / total_square) < 0.3:
        print("Нарушение нормы зелёных зон!")
        flag = 1
    now_development = int(input("Введите площадь очередной застройки (в га): "))
if flag == 0:
    print("Нормы соблюдены")
