"""
Задание 6: Измеряем улицы

Дан словарь city_streets: название города и длина его самой длинной улицы (в км):

    Санкт-Петербург — 630,
    Москва — 350,
    Казань — 420,
    Нижний Новгород — 480,
    Екатеринбург — 310.

Найти количество городов, в которых длина самой длинной улицы больше 400 км,
и вывести итог в формате:

    Количество городов: <число>

Например: «Количество городов: 3».
"""

city_streets = {
    "Санкт-Петербург": 630,
    "Москва": 350,
    "Казань": 420,
    "Нижний Новгород": 480,
    "Екатеринбург": 310,
}
city_length = list(city_streets.values())
amount = 0
for i in range (0, len(city_length)-1):
    if city_length[i] > 400:
        amount += 1
print(f"Количество городов: {amount}")
