"""
Задание 15: Баланс зелёных зон и застройки

В городе должна соблюдаться норма: не менее 30 % площади — зелёные зоны. Программа:

1. Запрашивает общую площадь района (в га).
2. В цикле while запрашивает площадь очередной застройки (в га) до ввода 0.
3. На каждом шаге:

   * добавляет площадь застройки к суммарной;
   * вычисляет текущую долю зелёных зон: (общая_площадь − суммарная_застройка) / общая_площадь;
   * если доля зелёных зон < 30 %, выводит предупреждение «Нарушение нормы зелёных зон!».

4. Если цикл завершился без нарушений, выводит: «Нормы соблюдены».
"""

total_area = float(input("Введите общую площадь района"))
total_building_area = 0
while True:
    bulding_area = float(input("Введите площадь застройки: "))
    if bulding_area == 0:
        break
    total_building_area += bulding_area
    green_space = (total_area - total_building_area) / total_area
    if green_space < 0.3:
        print("Нарушение нормы зелёных зон!")
        break
print("Нормы соблюдены")
