"""
Задание 15: Баланс зелёных зон и застройки

В городе должна соблюдаться норма: не менее 30 % площади — зелёные зоны. Программа:

1. Запрашивает общую площадь района (в га).
2. В цикле while запрашивает площадь очередной застройки (в га) до ввода 0.
3. На каждом шаге:

   * добавляет площадь застройки к суммарной;
   * вычисляет текущую долю зелёных зон: (общая_площадь − суммарная_застройка) / общая_площадь;
   * если доля зелёных зон < 30 %, выводит предупреждение «Нарушение нормы зелёных зон!».

4. Если цикл завершился без нарушений, выводит: «Нормы соблюдены».
"""

total = int(input())
cur = int(input())
green = 0
while cur != 0:
   green += cur
   cur = int(input())

if ((total - green) / total) >= 0.3:
   print("Нормы соблюдены")
else:
   print("Нарушение нормы зелёных зон!")